Write a Pandas program to create a dataframe from a dictionary and display it.
Sample data: {'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]}

In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame({'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]})

In [3]:
df

    X   Y   Z
0  78  84  86
1  85  94  97
2  96  89  96
3  80  83  72
4  86  86  83

 Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [5]:
import numpy as np
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [6]:
df=pd.DataFrame(data=exam_data, index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.
Sample Python dictionary data and list labels:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   name      10 non-null     object
 1   score     8 non-null      float64
 2   attempts  10 non-null     int64
 3   qualify   10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

Write a Pandas program to get the first 3 rows of a given DataFrame.

In [8]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [9]:
df[['name', 'score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

Write a Pandas program to select the specified columns and rows from a given data frame.
Select 'name' and 'score' columns in rows 1, 3, 5, 6 from the following data frame.

In [11]:
df.iloc[[1,3,5,6], [1,3]]

   score qualify
b    9.0      no
d    NaN      no
f   20.0     yes
g   14.5     yes

Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2.

In [12]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

Write a Pandas program to count the number of rows and columns of a DataFrame.

In [13]:
df.shape

(10, 4)

In [16]:
df.axes[0]

Index(['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j'], dtype='object')

In [14]:
len(df.axes[0])

10

In [17]:
df.axes[1]

Index(['name', 'score', 'attempts', 'qualify'], dtype='object')

In [15]:
len(df.axes[1])

4

Write a Pandas program to select the rows where the score is missing, i.e. is NaN.

In [18]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']
df=pd.DataFrame(data=exam_data, index=labels)
df[df['score'].isnull()]

    name  score  attempts qualify
d  James    NaN         3      no
h  Laura    NaN         1      no

Write a Pandas program to select the rows the score is between 15 and 20 (inclusive).

In [21]:
df[df['score'].between(15,20)]

        name  score  attempts qualify
c  Katherine   16.5         2     yes
f    Michael   20.0         3     yes
j      Jonas   19.0         1     yes

Write a Pandas program to select the rows where number of attempts in the examination is less than 2 and score greater than 15.

In [26]:
df[(df['attempts']<2) & (df['score']>=15)]

    name  score  attempts qualify
j  Jonas   19.0         1     yes

 Write a Pandas program to change the score in row 'd' to 11.5.

In [27]:
df.loc['d', 'score']=11.5
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James   11.5         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

Write a Pandas program to calculate the sum of the examination attempts by the students.

In [28]:
df['attempts'].sum()

19

Write a Pandas program to calculate the mean of all students' scores. Data is stored in a dataframe.

In [29]:
df['score'].mean()

13.333333333333334

Write a Pandas program to append a new row 'k' to data frame with given values for each column. Now delete the new row and return the original DataFrame.

In [31]:
df.loc['k'] = [1, 'Suresh', 'yes', 15.5]
df

        name   score attempts qualify
a  Anastasia    12.5        1     yes
b       Dima     9.0        3      no
c  Katherine    16.5        2     yes
d      James    11.5        3      no
e      Emily     9.0        2      no
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
j      Jonas    19.0        1     yes
k          1  Suresh      yes    15.5

In [32]:
df.drop('k')

        name score attempts qualify
a  Anastasia  12.5        1     yes
b       Dima   9.0        3      no
c  Katherine  16.5        2     yes
d      James  11.5        3      no
e      Emily   9.0        2      no
f    Michael  20.0        3     yes
g    Matthew  14.5        1     yes
h      Laura   NaN        1      no
i      Kevin   8.0        2      no
j      Jonas  19.0        1     yes

Write a Pandas program to sort the DataFrame first by 'name' in descending order, then by 'score' in ascending order.

In [34]:
df=df.sort_values(by=['name', 'score'], ascending=[False, True])
df

        name   score attempts qualify
f    Michael    20.0        3     yes
g    Matthew    14.5        1     yes
h      Laura     NaN        1      no
i      Kevin     8.0        2      no
c  Katherine    16.5        2     yes
j      Jonas    19.0        1     yes
d      James    11.5        3      no
e      Emily     9.0        2      no
b       Dima     9.0        3      no
a  Anastasia    12.5        1     yes
k          1  Suresh      yes    15.5

Write a Pandas program to replace the 'qualify' column contains the values 'yes' and 'no' with True and False.

In [36]:
df['quality']=df['qualify'].map({'yes': True, 'no': False})
df

        name   score attempts qualify quality
f    Michael    20.0        3     yes    True
g    Matthew    14.5        1     yes    True
h      Laura     NaN        1      no   False
i      Kevin     8.0        2      no   False
c  Katherine    16.5        2     yes    True
j      Jonas    19.0        1     yes    True
d      James    11.5        3      no   False
e      Emily     9.0        2      no   False
b       Dima     9.0        3      no   False
a  Anastasia    12.5        1     yes    True
k          1  Suresh      yes    15.5     NaN

Write a Pandas program to change the name 'James' to 'Suresh' in name column of the DataFrame.

In [37]:
df['name']=df['name'].replace('James', 'Suresh')
df

        name   score attempts qualify quality
f    Michael    20.0        3     yes    True
g    Matthew    14.5        1     yes    True
h      Laura     NaN        1      no   False
i      Kevin     8.0        2      no   False
c  Katherine    16.5        2     yes    True
j      Jonas    19.0        1     yes    True
d     Suresh    11.5        3      no   False
e      Emily     9.0        2      no   False
b       Dima     9.0        3      no   False
a  Anastasia    12.5        1     yes    True
k          1  Suresh      yes    15.5     NaN

 Write a Pandas program to delete the 'attempts' column from the DataFrame.

In [40]:
df.pop('attempts')
df

        name   score qualify quality
f    Michael    20.0     yes    True
g    Matthew    14.5     yes    True
h      Laura     NaN      no   False
i      Kevin     8.0      no   False
c  Katherine    16.5     yes    True
j      Jonas    19.0     yes    True
d     Suresh    11.5      no   False
e      Emily     9.0      no   False
b       Dima     9.0      no   False
a  Anastasia    12.5     yes    True
k          1  Suresh    15.5     NaN

Write a Pandas program to insert a new column in existing DataFrame.

In [42]:
color = ['Red', 'Red','Blue','Orange','Red','White','White','Blue','Green','Green','Red']
df['color'] = color
df

        name   score qualify quality   color
f    Michael    20.0     yes    True     Red
g    Matthew    14.5     yes    True     Red
h      Laura     NaN      no   False    Blue
i      Kevin     8.0      no   False  Orange
c  Katherine    16.5     yes    True     Red
j      Jonas    19.0     yes    True   White
d     Suresh    11.5      no   False   White
e      Emily     9.0      no   False    Blue
b       Dima     9.0      no   False   Green
a  Anastasia    12.5     yes    True   Green
k          1  Suresh    15.5     NaN     Red

In [43]:
df.drop('k')

        name score qualify quality   color
f    Michael  20.0     yes    True     Red
g    Matthew  14.5     yes    True     Red
h      Laura   NaN      no   False    Blue
i      Kevin   8.0      no   False  Orange
c  Katherine  16.5     yes    True     Red
j      Jonas  19.0     yes    True   White
d     Suresh  11.5      no   False   White
e      Emily   9.0      no   False    Blue
b       Dima   9.0      no   False   Green
a  Anastasia  12.5     yes    True   Green

Write a Pandas program to iterate over rows in a DataFrame.

In [47]:
for index, row in df.iterrows():
    print(row['name'], row['score'])

Michael 20.0
Matthew 14.5
Laura nan
Kevin 8.0
Katherine 16.5
Jonas 19.0
Suresh 11.5
Emily 9.0
Dima 9.0
Anastasia 12.5
1 Suresh

Write a Pandas program to get list from DataFrame column headers.

In [55]:
df.columns.values.tolist()

['name', 'score', 'qualify', 'quality', 'color']

In [66]:
df.iloc[:1].values.tolist()

[['Michael', 20.0, 'yes', True, 'Red']]

Write a Pandas program to rename columns of a given DataFrame

In [67]:
d = {'col1': [1, 2, 3], 'col2': [4, 5, 6], 'col3': [7, 8, 9]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [68]:
df.colummn=['column1', 'column2', 'column3']
df

/var/folders/g9/56rlvw7s6w54xn7rhdmb0qlw0000gn/T/ipykernel_10217/932554938.py:1: UserWarning: Pandas doesn't allow columns to be created via a new attribute name - see https://pandas.pydata.org/pandas-docs/stable/indexing.html#attribute-access
  df.colummn=['column1', 'column2', 'column3']

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6     9

In [69]:
df.rename(columns={'col1':'columnn1', 'col2':'column2', 'col3':'column3'})

   columnn1  column2  column3
0         1        4        7
1         2        5        8
2         3        6        9

Write a Pandas program to select rows from a given DataFrame based on values in some columns.

In [73]:
df['col1']==4

0    False
1    False
2    False
Name: col1, dtype: bool

In [77]:
df.loc[df['col1']==2]

   col1  col2  col3
1     2     5     8

Write a Pandas program to change the order of a DataFrame columns.

In [87]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [88]:
df=df[['col2', 'col3', 'col1']]
df

   col2  col3  col1
0     4     7     1
1     5     8     4
2     6     9     3
3     7     0     4
4     8     1     5

Write a Pandas program to add one row in an existing DataFrame.

In [89]:
df.loc[df.shape[0]]={'col1':10, 'col2':11, 'col3':12}
df

/var/folders/g9/56rlvw7s6w54xn7rhdmb0qlw0000gn/T/ipykernel_10217/2749242619.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df.loc[df.shape[0]]={'col1':10, 'col2':11, 'col3':12}

   col2  col3  col1
0     4     7     1
1     5     8     4
2     6     9     3
3     7     0     4
4     8     1     5
5    11    12    10

Write a Pandas program to write a DataFrame to CSV file using tab separator.

In [91]:
df.to_csv('file1.csv', sep='\t', index=False)

In [93]:
df=pd.read_csv('file1.csv')
df

  col2\tcol3\tcol1
0          4\t7\t1
1          5\t8\t4
2          6\t9\t3
3          7\t0\t4
4          8\t1\t5
5       11\t12\t10

In [94]:
df.to_csv('file11.csv', index=False)
df=pd.read_csv('file11.csv')
df

  col2\tcol3\tcol1
0          4\t7\t1
1          5\t8\t4
2          6\t9\t3
3          7\t0\t4
4          8\t1\t5
5       11\t12\t10

 Write a Pandas program to count city wise number of people from a given of data set (city, name of the person)

In [95]:
df1 = pd.DataFrame({'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
'city': ['California', 'Los Angeles', 'California', 'California', 'California', 'Los Angeles', 'Los Angeles', 'Georgia', 'Georgia', 'Los Angeles']})
df1

        name         city
0  Anastasia   California
1       Dima  Los Angeles
2  Katherine   California
3      James   California
4      Emily   California
5    Michael  Los Angeles
6    Matthew  Los Angeles
7      Laura      Georgia
8      Kevin      Georgia
9      Jonas  Los Angeles

In [100]:
df2=df1.groupby(by=["city"]).size().reset_index(name='Number of people')
df2

          city  Number of people
0   California                 4
1      Georgia                 2
2  Los Angeles                 4

Write a Pandas program to delete DataFrame row(s) based on given column value.

In [101]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [102]:
df=df[df['col2']!=5]
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0
4     5     8     1

In [103]:
df=df[df.col1!=5]
df

   col1  col2  col3
0     1     4     7
2     3     6     9
3     4     7     0

Write a Pandas program to widen output display to see more columns.

In [104]:
d = {'col1': [1, 4, 3, 4, 5], 'col2': [4, 5, 6, 7, 8], 'col3': [7, 8, 9, 0, 1]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

In [105]:
pd.set_option('display.max_rows', 500)

In [107]:
pd.set_option('display.max_columns', 500)

In [108]:
pd.set_option('display.width', 1000)

In [109]:
df

   col1  col2  col3
0     1     4     7
1     4     5     8
2     3     6     9
3     4     7     0
4     5     8     1

Write a Pandas program to select a row of series/dataframe by given integer index.

In [111]:
df.iloc[[2], [1]]

   col2
2     6

Write a Pandas program to replace all the NaN values with Zero's in a column of a dataframe.

In [112]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [113]:
df.fillna(0)

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    0.0         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    0.0         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

Write a Pandas program to convert index in a column of the given dataframe.

In [114]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [115]:
df.reset_index(level=0, inplace=True)

In [116]:
df

   index       name  score  attempts qualify
0      0  Anastasia   12.5         1     yes
1      1       Dima    9.0         3      no
2      2  Katherine   16.5         2     yes
3      3      James    NaN         3      no
4      4      Emily    9.0         2      no
5      5    Michael   20.0         3     yes
6      6    Matthew   14.5         1     yes
7      7      Laura    NaN         1      no
8      8      Kevin    8.0         2      no
9      9      Jonas   19.0         1     yes

In [120]:
df_str=df.to_string(index=False)
len(df_str)

461

In [121]:
df_str=df.to_string()
len(df_str)

494

Write a Pandas program to set a given value for particular cell in  DataFrame using index value.

In [122]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [130]:
df.at[8, 'name']='Kevinnn'
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8    Kevinnn    8.0         2      no
9      Jonas   19.0         1     yes

In [131]:
df.at[8, 'score']='14.0'
df

/var/folders/g9/56rlvw7s6w54xn7rhdmb0qlw0000gn/T/ipykernel_10217/2543861195.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise in a future error of pandas. Value '14.0' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  df.at[8, 'score']='14.0'

        name score  attempts qualify
0  Anastasia  12.5         1     yes
1       Dima   9.0         3      no
2  Katherine  16.5         2     yes
3      James   NaN         3      no
4      Emily   9.0         2      no
5    Michael  20.0         3     yes
6    Matthew  14.5         1     yes
7      Laura   NaN         1      no
8    Kevinnn  14.0         2      no
9      Jonas  19.0         1     yes

Write a Pandas program to count the NaN values in one or more columns in DataFrame.

df.isnull().values.sum(): This code uses the isnull() function to check which values in the DataFrame are null or NaN, and returns a DataFrame containing the same shape as df with True for missing values and False for non-missing values. The values attribute is used to extract the values of the resulting DataFrame and the sum() function is applied to the values to get the total count of missing values in the original DataFrame.

In [137]:
df.isnull()

    name  score  attempts  qualify
0  False  False     False    False
1  False  False     False    False
2  False  False     False    False
3  False   True     False    False
4  False  False     False    False
5  False  False     False    False
6  False  False     False    False
7  False   True     False    False
8  False  False     False    False
9  False  False     False    False

In [138]:
df.isnull().values

array([[False, False, False, False],
       [False, False, False, False],
       [False, False, False, False],
       [False,  True, False, False],
       [False, False, False, False],
       [False, False, False, False],
       [False, False, False, False],
       [False,  True, False, False],
       [False, False, False, False],
       [False, False, False, False]])

In [139]:
df.isnull().values.sum()

2

Write a Pandas program to drop a list of rows from a specified DataFrame.

In [140]:
df

        name score  attempts qualify
0  Anastasia  12.5         1     yes
1       Dima   9.0         3      no
2  Katherine  16.5         2     yes
3      James   NaN         3      no
4      Emily   9.0         2      no
5    Michael  20.0         3     yes
6    Matthew  14.5         1     yes
7      Laura   NaN         1      no
8    Kevinnn  14.0         2      no
9      Jonas  19.0         1     yes

In [144]:
df=df.drop([8,9])
df

        name score  attempts qualify
0  Anastasia  12.5         1     yes
1       Dima   9.0         3      no
2  Katherine  16.5         2     yes
3      James   NaN         3      no
4      Emily   9.0         2      no
5    Michael  20.0         3     yes
6    Matthew  14.5         1     yes
7      Laura   NaN         1      no

In [145]:
df=df.drop(df.index[[6,7]])
df

        name score  attempts qualify
0  Anastasia  12.5         1     yes
1       Dima   9.0         3      no
2  Katherine  16.5         2     yes
3      James   NaN         3      no
4      Emily   9.0         2      no
5    Michael  20.0         3     yes

In [149]:
df.drop(df.index[[3]], inplace=True)
df.reset_index()
df

        name score  attempts qualify
0  Anastasia  12.5         1     yes
1       Dima   9.0         3      no
2  Katherine  16.5         2     yes

Write a Pandas program to reset index in a given DataFrame.

In [150]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [151]:
df.drop([0,1], inplace=True)

In [152]:
df

        name  score  attempts qualify
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [153]:
df.reset_index(inplace=True)

In [154]:
df

   index       name  score  attempts qualify
0      2  Katherine   16.5         2     yes
1      3      James    NaN         3      no
2      4      Emily    9.0         2      no
3      5    Michael   20.0         3     yes
4      6    Matthew   14.5         1     yes
5      7      Laura    NaN         1      no
6      8      Kevin    8.0         2      no
7      9      Jonas   19.0         1     yes

Write a Pandas program to divide a DataFrame in a given ratio.

In [155]:
data=np.random.randn(10,2)
data

array([[-1.33711838, -2.39435711],
       [ 0.37640251,  0.49890095],
       [ 2.17054379, -0.31791085],
       [ 0.18203041,  0.83146528],
       [-0.84995688,  0.17795246],
       [-0.38948228, -0.68680057],
       [ 0.23006953, -1.33953497],
       [-0.02865153, -0.82834457],
       [ 0.92999655, -0.34436122],
       [-2.90189476, -0.71753238]])

In [156]:
df=pd.DataFrame(data)
df

          0         1
0 -1.337118 -2.394357
1  0.376403  0.498901
2  2.170544 -0.317911
3  0.182030  0.831465
4 -0.849957  0.177952
5 -0.389482 -0.686801
6  0.230070 -1.339535
7 -0.028652 -0.828345
8  0.929997 -0.344361
9 -2.901895 -0.717532

In [157]:
part_70=df.sample(frac=0.7, random_state=10)
part_70

          0         1
8  0.929997 -0.344361
2  2.170544 -0.317911
5 -0.389482 -0.686801
6  0.230070 -1.339535
3  0.182030  0.831465
1  0.376403  0.498901
0 -1.337118 -2.394357

In [158]:
part_70.index

Index([8, 2, 5, 6, 3, 1, 0], dtype='int64')

In [159]:
part_30=df.drop(part_70.index)
part_30

          0         1
4 -0.849957  0.177952
7 -0.028652 -0.828345
9 -2.901895 -0.717532

Write a Pandas program to combining two series into a DataFrame.

In [160]:
s1=pd.Series(['100', '200', 'python', '300.12', '400'])
s2=pd.Series(['10', '20', 'php', '30.12', '40'])

In [161]:
s1

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [162]:
s2

0       10
1       20
2      php
3    30.12
4       40
dtype: object

In [163]:
df=pd.concat([s1, s2], axis=1)
df

        0      1
0     100     10
1     200     20
2  python    php
3  300.12  30.12
4     400     40

In [164]:
df=pd.concat([s1, s2], axis=0)
df

0       100
1       200
2    python
3    300.12
4       400
0        10
1        20
2       php
3     30.12
4        40
dtype: object

Write a Pandas program to shuffle a given DataFrame rows.

In [175]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [176]:
df=df.sample(frac=1).reset_index(drop=True)
df

        name  score  attempts qualify
0    Michael   20.0         3     yes
1  Anastasia   12.5         1     yes
2      James    NaN         3      no
3      Jonas   19.0         1     yes
4    Matthew   14.5         1     yes
5      Kevin    8.0         2      no
6      Emily    9.0         2      no
7      Laura    NaN         1      no
8  Katherine   16.5         2     yes
9       Dima    9.0         3      no

Write a Pandas program to convert DataFrame column type from string to datetime.

In [182]:
s = pd.Series(['3/11/2000', '3/12/2000', '3/13/2000'])
df=pd.DataFrame(pd.to_datetime(s), columns=['datetime'])
df

    datetime
0 2000-03-11
1 2000-03-12
2 2000-03-13

Write a Pandas program to rename a specific column name in a given DataFrame.

In [183]:
df.rename(columns={'datetime':'date_time'}, inplace=True)
df

   date_time
0 2000-03-11
1 2000-03-12
2 2000-03-13

Write a Pandas program to get a list of a specified column of a DataFrame.

In [187]:
df['date_time'].tolist()

[Timestamp('2000-03-11 00:00:00'),
 Timestamp('2000-03-12 00:00:00'),
 Timestamp('2000-03-13 00:00:00')]

Write a Pandas program to create a DataFrame from a Numpy array and specify the index column and column headers.

In [193]:
dtype = [('Col1','int32'), ('Col2','float32'), ('Col3','float32')]
dtype

[('Col1', 'int32'), ('Col2', 'float32'), ('Col3', 'float32')]

In [194]:
values = np.zeros(15, dtype=dtype)
values

array([(0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.),
       (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.), (0, 0., 0.)],
      dtype=[('Col1', '<i4'), ('Col2', '<f4'), ('Col3', '<f4')])

In [195]:
index = ['Index'+str(i) for i in range(1, len(values)+1)]
index

['Index1',
 'Index2',
 'Index3',
 'Index4',
 'Index5',
 'Index6',
 'Index7',
 'Index8',
 'Index9',
 'Index10',
 'Index11',
 'Index12',
 'Index13',
 'Index14',
 'Index15']

In [196]:
df = pd.DataFrame(values, index=index)
df

         Col1  Col2  Col3
Index1      0   0.0   0.0
Index2      0   0.0   0.0
Index3      0   0.0   0.0
Index4      0   0.0   0.0
Index5      0   0.0   0.0
Index6      0   0.0   0.0
Index7      0   0.0   0.0
Index8      0   0.0   0.0
Index9      0   0.0   0.0
Index10     0   0.0   0.0
Index11     0   0.0   0.0
Index12     0   0.0   0.0
Index13     0   0.0   0.0
Index14     0   0.0   0.0
Index15     0   0.0   0.0

Write a Pandas program to find the row for where the value of a given column is maximum.

In [199]:
d = {'col1': [1, 2, 3, 4, 7], 'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     7     5    11

In [200]:
df['col1'].max()

7

In [201]:
df['col1'].argmax()

4

 Write a Pandas program to check whether a given column is present in a DataFrame or not.

In [204]:
df.columns

Index(['col1', 'col2', 'col3'], dtype='object')

In [206]:
if 'col11' in df.columns:
    print("yes")
else:
    print("no")

no

Write a Pandas program to get the specified row value of a given DataFrame.

In [207]:
df.iloc[0]

col1    1
col2    4
col3    7
Name: 0, dtype: int64

Write a Pandas program to get the datatypes of columns of a DataFrame.

In [208]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [209]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

Write a Pandas program to append data to an empty DataFrame.

In [210]:
df=pd.DataFrame()
df

Empty DataFrame
Columns: []
Index: []

In [211]:
data=pd.DataFrame({'col1':range(3), 'col2':range(3)})
data

   col1  col2
0     0     0
1     1     1
2     2     2

In [215]:
pd.concat([df, data], axis=0)

   col1  col2
0     0     0
1     1     1
2     2     2

In [216]:
pd.concat([df, data], axis=1)

   col1  col2
0     0     0
1     1     1
2     2     2

Write a Pandas program to sort a given DataFrame by two or more columns.

In [232]:
exam_data = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
df = pd.DataFrame(exam_data)
df

        name  score  attempts qualify
0  Anastasia   12.5         1     yes
1       Dima    9.0         3      no
2  Katherine   16.5         2     yes
3      James    NaN         3      no
4      Emily    9.0         2      no
5    Michael   20.0         3     yes
6    Matthew   14.5         1     yes
7      Laura    NaN         1      no
8      Kevin    8.0         2      no
9      Jonas   19.0         1     yes

In [233]:
df.sort_values(by=['attempts', 'score'], ascending=[True, False])

        name  score  attempts qualify
9      Jonas   19.0         1     yes
6    Matthew   14.5         1     yes
0  Anastasia   12.5         1     yes
7      Laura    NaN         1      no
2  Katherine   16.5         2     yes
4      Emily    9.0         2      no
8      Kevin    8.0         2      no
5    Michael   20.0         3     yes
1       Dima    9.0         3      no
3      James    NaN         3      no

Write a Pandas program to convert the datatype of a given column (floats to ints).

In [234]:
df.dtypes

name         object
score       float64
attempts      int64
qualify      object
dtype: object

In [235]:
df.fillna(0, inplace=True)

In [236]:
df.score=df['score'].astype(int)

In [237]:
df

        name  score  attempts qualify
0  Anastasia     12         1     yes
1       Dima      9         3      no
2  Katherine     16         2     yes
3      James      0         3      no
4      Emily      9         2      no
5    Michael     20         3     yes
6    Matthew     14         1     yes
7      Laura      0         1      no
8      Kevin      8         2      no
9      Jonas     19         1     yes

Write a Pandas program to remove infinite values from a given DataFrame.

In [238]:
df = pd.DataFrame([1000, 2000, 3000, -4000, np.inf, -np.inf])
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     inf
5    -inf

In [239]:
df.replace([np.inf, -np.inf], np.nan, inplace=True)

In [240]:
df

        0
0  1000.0
1  2000.0
2  3000.0
3 -4000.0
4     NaN
5     NaN

Write a Pandas program to insert a given column at a specific column index in a DataFrame.

In [241]:
d = {'col2': [4, 5, 6, 9, 5], 'col3': [7, 8, 12, 1, 11]}
df = pd.DataFrame(data=d)
df

   col2  col3
0     4     7
1     5     8
2     6    12
3     9     1
4     5    11

In [242]:
new_col=[1,2,3,4,5]
idx=0
df.insert(loc=0, column='col0', value=new_col)
df

   col0  col2  col3
0     1     4     7
1     2     5     8
2     3     6    12
3     4     9     1
4     5     5    11

Write a Pandas program to convert a given list of lists into a Dataframe.

In [243]:
my_lists = [['col1', 'col2'], [2, 4], [1, 3]]
df=pd.DataFrame(my_lists[1:], columns=my_lists[0])
df

   col1  col2
0     2     4
1     1     3

Write a Pandas program to group by the first column and get second column as lists in rows.

In [244]:
df = pd.DataFrame( {'col1':['C1','C1','C2','C2','C2','C3','C2'], 'col2':[1,2,3,3,4,6,5]})
df

  col1  col2
0   C1     1
1   C1     2
2   C2     3
3   C2     3
4   C2     4
5   C3     6
6   C2     5

In [247]:
df.groupby(by=['col1'])['col2'].apply(list)

col1
C1          [1, 2]
C2    [3, 3, 4, 5]
C3             [6]
Name: col2, dtype: object

Write a Pandas program to get column index from column name of a given DataFrame.

In [250]:
df.columns.get_loc("col1")

0

Write a Pandas program to count number of columns of a DataFrame.

In [251]:
df.columns

Index(['col1', 'col2'], dtype='object')

In [252]:
len(df.columns)

2

Write a Pandas program to select all columns, except one given column in a DataFrame.

In [253]:
df=df.iloc[:, df.columns!='col2']
df

  col1
0   C1
1   C1
2   C2
3   C2
4   C2
5   C3
6   C2

Write a Pandas program to get first n records of a DataFrame.

In [254]:
df.head(3)

  col1
0   C1
1   C1
2   C2

Write a Pandas program to get last n records of a DataFrame.

In [255]:
df.tail(3)

  col1
4   C2
5   C3
6   C2

Write a Pandas program to get topmost n records within each group of a DataFrame.

In [257]:
df.groupby('col1').head(2).reset_index(drop=True)

  col1
0   C1
1   C1
2   C2
3   C2
4   C3

Write a Pandas program to get lowest n records within each group of a given DataFrame.

In [258]:
d = {'col1': [1, 2, 3, 4, 7, 11], 'col2': [4, 5, 6, 9, 5, 0], 'col3': [7, 5, 8, 12, 1,11]}
df = pd.DataFrame(data=d)
df

   col1  col2  col3
0     1     4     7
1     2     5     5
2     3     6     8
3     4     9    12
4     7     5     1
5    11     0    11

In [264]:
df1=df.nlargest(2, columns=['col1'])
df1

   col1  col2  col3
5    11     0    11
4     7     5     1

In [265]:
df1=df.nsmallest(2, columns=['col1'])
df1

   col1  col2  col3
0     1     4     7
1     2     5     5

 Write a Pandas program to check for inequality of two given DataFrames.

In [266]:
df1 = pd.DataFrame({'W':[68,75,86,80,None],'X':[78,85,None,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df2 = pd.DataFrame({'W':[78,75,86,80,None],'X':[78,85,96,80,76], 'Y':[84,84,89,83,86],'Z':[86,97,96,72,83]});

In [268]:
df1

      W     X   Y   Z
0  68.0  78.0  84  86
1  75.0  85.0  94  97
2  86.0   NaN  89  96
3  80.0  80.0  83  72
4   NaN  86.0  86  83

In [269]:
df2

      W   X   Y   Z
0  78.0  78  84  86
1  75.0  85  84  97
2  86.0  96  89  96
3  80.0  80  83  72
4   NaN  76  86  83

In [267]:
df1.ne(df2)

       W      X      Y      Z
0   True  False  False  False
1  False  False   True  False
2  False   True  False  False
3  False  False  False  False
4   True   True  False  False

In [271]:
df1.eq(df2)

       W      X      Y     Z
0  False   True   True  True
1   True   True  False  True
2   True  False   True  True
3   True   True   True  True
4  False  False   True  True

Write a Pandas program to create a DataFrame from the clipboard (data from an Excel spreadsheet or a Google Sheet)

In [273]:
df=pd.read_clipboard()

In [277]:
df

Empty DataFrame
Columns: [pd.read_clipboard()]
Index: []

Write a Pandas program to replace the current value in a dataframe column based on last largest value. If the current value is less than last largest value replaces the value with 0.

In [278]:
df1=pd.DataFrame({'rnum':[23, 21, 27, 22, 34, 33, 34, 31, 25, 22, 34, 19, 31, 32, 19]})
df1

    rnum
0     23
1     21
2     27
3     22
4     34
5     33
6     34
7     31
8     25
9     22
10    34
11    19
12    31
13    32
14    19

In [282]:
df1['rnum']=df1['rnum'].where(df1.rnum.eq(df1.rnum.max()), 0)
df1

    rnum
0    0.0
1    0.0
2    0.0
3    0.0
4   34.0
5    0.0
6   34.0
7    0.0
8    0.0
9    0.0
10  34.0
11   0.0
12   0.0
13   0.0
14   0.0

Write a Pandas program to get the numeric representation of an array by identifying distinct values of a given column of a dataframe.

In [285]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Gino Mcneill'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Gino Mcneill     15/09/1997  23.0

In [286]:
label1, unique1=pd.factorize(df['Name'])

In [287]:
label1

array([0, 1, 2, 3, 1])

In [288]:
unique1

Index(['Alberto Franco', 'Gino Mcneill', 'Ryan Parkes', 'Eesha Hinton'], dtype='object')

 Write a Pandas program to clean object column with mixed data of a given DataFrame using regular expression.

In [289]:
d = {"agent": ["a001", "a002", "a003", "a003", "a004"], "purchase":[4500.00, 7500.00, "$3000.25", "$1250.35", "9000.00"]}
d

{'agent': ['a001', 'a002', 'a003', 'a003', 'a004'],
 'purchase': [4500.0, 7500.0, '$3000.25', '$1250.35', '9000.00']}

In [291]:
df=pd.DataFrame(d)

In [292]:
df['purchase'].apply(type)

0    <class 'float'>
1    <class 'float'>
2      <class 'str'>
3      <class 'str'>
4      <class 'str'>
Name: purchase, dtype: object

In [293]:
df['purchase']=df['purchase'].replace('[$,]', '', regex=True).astype('float')

In [294]:
df

  agent  purchase
0  a001   4500.00
1  a002   7500.00
2  a003   3000.25
3  a003   1250.35
4  a004   9000.00

In [295]:
df['purchase'].apply(type)

0    <class 'float'>
1    <class 'float'>
2    <class 'float'>
3    <class 'float'>
4    <class 'float'>
Name: purchase, dtype: object

Write a Pandas program to use a local variable within a query.

In [296]:
df = pd.DataFrame({'W':[68,75,86,80,66],'X':[78,85,96,80,86], 'Y':[84,94,89,83,86],'Z':[86,97,96,72,83]});
df

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
2  86  96  89  96
3  80  80  83  72
4  66  86  86  83

In [297]:
maxx=df['W'].max()
maxx

86

In [298]:
df.query('W<@maxx')

    W   X   Y   Z
0  68  78  84  86
1  75  85  94  97
3  80  80  83  72
4  66  86  86  83

Write a Pandas program to fill missing values in time series data.

In [299]:
sdata = {"c1":[120, 130 ,140, 150, np.nan, 170], "c2":[7, np.nan, 10, np.nan, 5.5, 16.5]}
df = pd.DataFrame(sdata)
df

      c1    c2
0  120.0   7.0
1  130.0   NaN
2  140.0  10.0
3  150.0   NaN
4    NaN   5.5
5  170.0  16.5

In [301]:
df.bfill()

      c1    c2
0  120.0   7.0
1  130.0  10.0
2  140.0  10.0
3  150.0   5.5
4  170.0   5.5
5  170.0  16.5

Write a Pandas program to create DataFrames that contains random values, contains missing values, contains datetime values and contains mixed values.

In [ ]:
### TO DO

Write a Pandas program to combine many given series to create a DataFrame.

In [302]:
sr1 = pd.Series(['php', 'python', 'java', 'c#', 'c++'])
sr2 = pd.Series([1, 2, 3, 4, 5])

In [305]:
df=pd.concat([sr1, sr2], axis=1).reset_index(drop=True)
df

        0  1
0     php  1
1  python  2
2    java  3
3      c#  4
4     c++  5

In [308]:
df=pd.DataFrame({'sr1': sr1, 'sr2': sr2})
df

      sr1  sr2
0     php    1
1  python    2
2    java    3
3      c#    4
4     c++    5

Write a Pandas program to display memory usage of a given DataFrame and every column of the DataFrame.

In [309]:
df.info(memory_usage='deep')

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   sr1     5 non-null      object
 1   sr2     5 non-null      int64
dtypes: int64(1), object(1)
memory usage: 475.0 bytes

In [310]:
df.memory_usage(deep=True)

Index    132
sr1      303
sr2       40
dtype: int64

 Write a Pandas program to convert continuous values of a column in a given DataFrame to categorical.

In [312]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton', 'Kierra Gentry'],
      'age': [18, 22, 85, 50, 80, 5]
})
df

             name  age
0  Alberto Franco   18
1    Gino Mcneill   22
2     Ryan Parkes   85
3    Eesha Hinton   50
4    Syed Wharton   80
5   Kierra Gentry    5

In [315]:
df["age_groups"] = pd.cut(df["age"], bins = [0, 18, 65, 99], labels = ["kids", "adult", "elderly"])
df

             name  age age_groups
0  Alberto Franco   18       kids
1    Gino Mcneill   22      adult
2     Ryan Parkes   85    elderly
3    Eesha Hinton   50      adult
4    Syed Wharton   80    elderly
5   Kierra Gentry    5       kids

Write a Pandas program to merge datasets and check uniqueness.

In [316]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [317]:
df1 = df.copy(deep = True)
df = df.drop([0, 1])
df1 = df1.drop([2])

In [318]:
df_1_1=pd.merge(df, df1, validate='one_to_one')
df_1_1

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

In [319]:
df_m_1=pd.merge(df, df1, validate='many_to_one')
df_m_1

           Name Date_Of_Birth    Age
0  Eesha Hinton     11/05/2002  22.0
1  Syed Wharton     15/09/1997  23.0

Write a Pandas program to rename all columns with the same pattern of a given DataFrame.

In [320]:
df = pd.DataFrame({
    'Name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'Date_Of_Birth ': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'Age': [18.5, 21.2, 22.5, 22, 23]
})
df

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
2     Ryan Parkes     25/09/1998  22.5
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [326]:
df.columns=df.columns.str.lower().str.rstrip()
df

             name date_of_birth   age
0  Alberto Franco    17/05/2002  18.5
1    Gino Mcneill    16/02/1999  21.2
2     Ryan Parkes    25/09/1998  22.5
3    Eesha Hinton    11/05/2002  22.0
4    Syed Wharton    15/09/1997  23.0

Write a Pandas program to split a given DataFrame into two random subsets.

In [327]:
df = pd.DataFrame({
    'name': ['Alberto Franco','Gino Mcneill','Ryan Parkes', 'Eesha Hinton', 'Syed Wharton'],
    'date_of_birth': ['17/05/2002','16/02/1999','25/09/1998','11/05/2002','15/09/1997'],
    'age': ['18', '21', '22', '22', '23']
})
df

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23

In [328]:
df_1=df.sample(frac=0.6)

In [329]:
df2=df.drop(df_1.index)

In [330]:
df1

             Name Date_Of_Birth    Age
0  Alberto Franco     17/05/2002  18.5
1    Gino Mcneill     16/02/1999  21.2
3    Eesha Hinton     11/05/2002  22.0
4    Syed Wharton     15/09/1997  23.0

In [331]:
df2

           name date_of_birth age
2   Ryan Parkes    25/09/1998  22
3  Eesha Hinton    11/05/2002  22

Write a Pandas program to select columns by data type of a given DataFrame.

In [332]:
df.select_dtypes(include='number')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4]

In [333]:
df.select_dtypes(include='object')

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21
2     Ryan Parkes    25/09/1998  22
3    Eesha Hinton    11/05/2002  22
4    Syed Wharton    15/09/1997  23

Write a Pandas program to reverse order (rows, columns) of a given DataFrame.

In [334]:
df.loc[:, ::-1]

  age date_of_birth            name
0  18    17/05/2002  Alberto Franco
1  21    16/02/1999    Gino Mcneill
2  22    25/09/1998     Ryan Parkes
3  22    11/05/2002    Eesha Hinton
4  23    15/09/1997    Syed Wharton

In [336]:
df[::-1]

             name date_of_birth age
4    Syed Wharton    15/09/1997  23
3    Eesha Hinton    11/05/2002  22
2     Ryan Parkes    25/09/1998  22
1    Gino Mcneill    16/02/1999  21
0  Alberto Franco    17/05/2002  18

In [337]:
df[::-1].reset_index(drop=True)

             name date_of_birth age
0    Syed Wharton    15/09/1997  23
1    Eesha Hinton    11/05/2002  22
2     Ryan Parkes    25/09/1998  22
3    Gino Mcneill    16/02/1999  21
4  Alberto Franco    17/05/2002  18

Write a Pandas program to add a prefix or suffix to all columns of a given DataFrame.

In [338]:
df.add_prefix('prefix_')

      prefix_name prefix_date_of_birth prefix_age
0  Alberto Franco           17/05/2002         18
1    Gino Mcneill           16/02/1999         21
2     Ryan Parkes           25/09/1998         22
3    Eesha Hinton           11/05/2002         22
4    Syed Wharton           15/09/1997         23

In [339]:
df.add_suffix('_suffix')

      name_suffix date_of_birth_suffix age_suffix
0  Alberto Franco           17/05/2002         18
1    Gino Mcneill           16/02/1999         21
2     Ryan Parkes           25/09/1998         22
3    Eesha Hinton           11/05/2002         22
4    Syed Wharton           15/09/1997         23

Write a Pandas program to remove last n rows of a given DataFrame.

In [340]:
df=df.iloc[:-3]
df

             name date_of_birth age
0  Alberto Franco    17/05/2002  18
1    Gino Mcneill    16/02/1999  21

Write a Pandas program to remove first n rows of a given DataFrame.

In [341]:
df=df.iloc[:1]

In [342]:
df

             name date_of_birth age
0  Alberto Franco    17/05/2002  18